# Pandas

# data analysis using pandas

In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

In [3]:
mydata=pd.read_excel(r"C:\Users\sk414\OneDrive\Desktop\ML project\DataSets-master\DataSets-master\Population_Summary.xlsx")

In [41]:
#mydata

In [5]:
type(mydata)

pandas.core.frame.DataFrame

In [6]:
mydata.shape

(35, 9)

In [7]:
mydata.size

315

In [8]:
len(mydata)

35

In [25]:
#mydata.head(1)#to see only desired samples from starting

In [24]:
#mydata.tail(5)# to see desired from downward samples

In [23]:
#mydata.sample(5)# to see random samples from data

In [17]:
# Pandas is an open source python package built on top of numpy developed by wes McKinney

In [22]:
#mydata.describe().T

In [21]:
#mydata.info() # to know about the data missing or type of data

In [32]:
st1=mydata["State_UT"]

In [38]:
#st1

In [34]:
type(st1)

pandas.core.series.Series

In [28]:
st=mydata[["State_UT","Population"]]

In [37]:
#st

In [30]:
type(st)# 2d dataframe

pandas.core.frame.DataFrame

In [39]:
#mydata.columns

In [40]:
#mydata.keys()

In [42]:
mydata.head(1)

,Rank,State_UT,Population,Rulal,Urban,Share,Growth,Country,World_Rank
0,1,Uttar Pradesh,199812341,77.73,22.27,16.5,20.23,Brazil,5

In [43]:
mydata["Growth"].min()

-0.58

In [45]:
mydata[mydata["Growth"]==mydata["Growth"].min()]

,Rank,State_UT,Population,Rulal,Urban,Share,Growth,Country,World_Rank
24,24,Nagaland,1978502,71.14,28.86,0.16,-0.58,Botswana,148

In [46]:
mydata[mydata["Growth"]==mydata["Growth"].max()]

,Rank,State_UT,Population,Rulal,Urban,Share,Growth,Country,World_Rank
32,UT4,D.& N.Haveli,343709,53.28,46.72,0.03,55.88,Belize,179

In [48]:
mydata[mydata["Growth"]==mydata["Growth"].median()]

,Rank,State_UT,Population,Rulal,Urban,Share,Growth,Country,World_Rank
19,19,Uttarakhand,10086292,69.77,30.23,0.83,18.81,Hungary,89

In [49]:
mydata[mydata["Growth"]==mydata["Growth"].mode()]

,Rank,State_UT,Population,Rulal,Urban,Share,Growth,Country,World_Rank
10,11,Odisha,41974218,83.31,16.69,3.47,14.05,Argentina,32
33,UT5,Daman & Diu,243247,24.83,75.17,0.02,53.76,Vanuatu,184

In [51]:
mydata["Population"].sum(axis=0)

1210854977

In [52]:
mydata["%Pop"]=mydata["Population"]/mydata["Population"].sum(axis=0)

In [68]:
#mydata

In [62]:
kp=mydata[mydata["State_UT"]=="Karnataka"]["Population"].values[0]

In [70]:
#mydata[mydata["Population"]>kp]

In [66]:
len(mydata[mydata["Population"]>kp])

8

In [69]:
#mydata[mydata["Population"]>kp]["State_UT"]

In [73]:
mydata.iloc[:10,2:4]

   Population  Rulal
0   199812341  77.73
1   112374333  54.78
2   104099452  88.71
3    91276115  68.13
4    84580777  66.64
5    72626809  72.37
6    72147030  51.60
7    68548437  75.13
8    61095297  61.33
9    60439692  57.40

In [74]:
mydata.loc[:10,"State_UT":"Population"]

          State_UT  Population
0    Uttar Pradesh   199812341
1      Maharashtra   112374333
2            Bihar   104099452
3      West Bengal    91276115
4   Andhra Pradesh    84580777
5   Madhya Pradesh    72626809
6       Tamil Nadu    72147030
7        Rajasthan    68548437
8        Karnataka    61095297
9          Gujarat    60439692
10          Odisha    41974218

In [75]:
mydata.loc[1:10,"State_UT":"Population"]

          State_UT  Population
1      Maharashtra   112374333
2            Bihar   104099452
3      West Bengal    91276115
4   Andhra Pradesh    84580777
5   Madhya Pradesh    72626809
6       Tamil Nadu    72147030
7        Rajasthan    68548437
8        Karnataka    61095297
9          Gujarat    60439692
10          Odisha    41974218

In [ ]:
ele2019=pd.read_excel(r"")